src/InformationRegisters/МП_ИзмененныеТрудозатраты/МП_ИзмененныеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ИзмененныеТрудозатраты</name>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Граница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/МП_ИзмененияВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

//Изменяет запись о трудозатрате для дальнейшего удаления в мобильном приложении
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь для изменения
//  День - Дата - День для отбора трудозатраты
//  НомерДобавления - НомерДобавления для трудозатраты
Процедура ЗафиксироватьУдалениеЗаписиОТрудозатрате(Пользователь, День, НомерДобавления) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМобильныеКлиенты") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерДобавления) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МП_ИзмененныеТрудозатраты.УдалитьЗаписьОТрудозатрате(Пользователь, День, НомерДобавления);
	
КонецПроцедуры
